#include <stdio.h>
int main()
{
	int MyVar = 10;
	int Number; // не определена
	Number = 50;
	int var, perem, folder; // тип данных int
	//Тип_данных Имя_переменной=Значение;
	//Значение=Данные_значение
	var = 100;
	// типы данных
	// в C нету строк, есть массивы символов
	// char = один байт в которос сохроняется один символ 'A' использование двойных ковыче не коректно
	// int целое десятичное число 10
	// float число с плавающей точкой (до 6 знаков) 0.123456
	// double число с плавающей точкой (lj 10 знаков) 0.123456789
	// short 2 байта, long  4 байта большое целое, long long огромное целлое 8 байт
	// Обьявление переменных следует задавать зараниее до выполнения кода
	char letter = 'A';
	int number1 = 56;
	int number2,number3;
	number2 = 45;
        short MyNumber = 999;
	float decimal = 2.5;
	double decimal_double = 9.12345;
	long long MyLong = 23441241241243;

}	
