//Вы создали игру в жанре шутер. Теперь ваш дизайнер придумал новое неизвестное никому оружее - дробовик.
//Известно, что дробовики стреляют дробью (внезапно, правда?).
//Ваша задача - рассчитать суммарный урон, наненсенный выстрелом из дробовика.

//Формат ввода
//Сначала вводится количество дробинок. Затем урон от каждой дробинки.
//Урон от каждой дробинки выражается простой дробью, её числитель и знаменатель вводятся на отдельных строках.

//Формат вывода
//Суммарный урон, выраженный простой несократимой дробью с дробной чертой между числителем и знаменателем.

//Ввод  <--- А нет ли тут ошибки????
//3
//1
//50
//2
//30
//4
//90

//Вывод
//59/450

//package main

//import "fmt"

//func main() {

//	var (
//		a int
//		b int
//	)

///	a = 3 + 50 + 30 + 90
//	b = 1 + 2 + 4 + 59
//fmt.scan(&a, &b)

//	fmt.Println(a, b)

//}

//не понял чего надо тут делать
