//5-ая строка Паскаля

//Треугольник Паскаля - великое математическое явление, которое позволяет решать множество различных задач невообразимо простым способом.
//В частности, этот самый треугольник используется при разложении бинома Ньютона.

//Но мы не будем здесь лезть в детали, главное для нас - это кодинг.

//Напишите программу, которая принимает на вход натуральное число n∈N - номер строки, до которой включительно хочется получить тот самый великий треугольник Паскаля.

//На выходе - сам треугольник.

//Формат ввода
//Натуральное число n ∈ N

//Формат вывода
//Треугольник Паскаля до n-ой строки включительно

//Ввод
//3

//Вывод
//   1
//  1 1
// 1 2 1

//Натура́льные чи́сла (от лат. naturalis «естественный») — числа, возникающие естественным образом при счёте (1, 2, 3, 4, 5, 6, 7 и так далее).
//Последовательность всех натуральных чисел, расположенных в порядке возрастания, называется натуральным рядом

package main

import "fmt"

func main() {

	//for x, y := 0, 1; x <= 10 && y <= 12; x, y = x+1, y+2 {
	//	fmt.Printf("%d + %d = %d\n", x, y, x+y)

	//}

	//for i := 0; i < 10; i++ {
	//	for j := 0; j < i; j++ {
	//		fmt.Print("*")
	//	}
	//	fmt.Println()
	//}
	//fmt.Println("По идеи выше треугольник")

	//for a := 0; a < 7; a++ {
	//	for b := 0; b < a; b++ {
	//		fmt.Print("#")
	//		for c := 0; c < b; c++ {
	//			fmt.Print("*")
	//		}
	//	}
	//	fmt.Println()
	//}

	// типа квадрат
	//for t := 0; t < 5; t++ {
	//	for i := 0; i < 5; i++ {
	//		fmt.Print("#")
	//	}
	//	fmt.Println()
	//}

	//fmt.Printf("   %d\n", x)
	//fmt.Printf("  %d %d\n", x, x)
	//fmt.Printf(" %d %d %d\n", x, x, x)

	//brisk := " "
	//crisk := "X"

	//for a := 0; a < 10; a++ {
	//	fmt.Println()
	//	for b, c := 0, 0; b < 10 && c < 10; b, c = b+1, c+1 {
	//		fmt.Printf("%s%s", brisk, crisk)
	//	}
	//}

	//for a := 0; a < 5; a++ {
	//	fmt.Printf(" ")
	//	for c := 0; c < 6; c++ {
	//		fmt.Printf(" ")
	//		for b := 0; b < 8; b++ {
	//			fmt.Printf("X")
	//		}
	//	}
	//	fmt.Println()
	//}

	//n := 3
	//i := n
	//j := 1

	//for i >= 1 {
	//	for j <= i {
	//		fmt.Printf(" " + "#")
	//		j++
	//	}
	//	fmt.Println()
	//	j = 1
	//	i--
	//}

	var (
	//a int
	//b int
	//c int
	//e int
	)

	//for a := 0; a < 10; a++ {
	//	for b := 0; b < a; b++ {
	//		fmt.Print("S")
	//	}
	//	for c := 0; c < a; c++ {
	//		fmt.Print("Y")
	//	}
	//	for d := 0; d < a; d++ {
	//		fmt.Print("H")
	//	}
	//	fmt.Println()
	//}

	//for a := 0; a < 10; a++ {
	//	for b := 0; b < 10; b = b + 1 {
	//		fmt.Print("")
	//	}
	//	for c := 0; c < a; c = c + 1 {
	//		fmt.Print(" 2 ")
	//	}
	//	for d := 0; d < 10; d = d + 1 {
	//		fmt.Print("")
	//	}
	//	fmt.Println()
	//}

	//for a := 0; a < 10; a++ {
	//	for b := 0; b < 10; b = b + 1 {
	//		fmt.Print("")
	//	}
	//	for c := 10; c > a; c = c - 1 {
	//		fmt.Print("2")
	//	}
	//	for d := 0; d < 10; d = d + 1 {
	//		fmt.Print("")
	//	}
	//	fmt.Println()
	//}

	//for i := 50; i > 0; i -= 10 {
	//	fmt.Println(i)
	//}

	//for a := 0; a < 10; a++ {
	//	for b := 10; b > a; b -= 1 {
	//		fmt.Print("4")
	//	}
	//	for c := 0; a > c; c++ {
	//		fmt.Print("2")
	//	}
	//	for d := 0; d < a; d++ {
	//		fmt.Print("5")
	//	}
	//	fmt.Println()
	//}

	for a := 0; a < 5; a++ {
		for b := 5; b > a; b -= 1 {
			fmt.Print(" ")
		}
		for c := 0; a > c; c++ {
			fmt.Print(" X")
		}
		for d := 0; d < a; d++ {
			fmt.Print(" ")
		}
		fmt.Println()
	}

}
